%HSV_Feature_main
clc;close all;clear all;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%说明： CBIR图像检索测试仿真
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    %第2步：图像相似检索实验
    load ImgDB_3Fea.mat   %把图像的所有特征加载进来 ImgSet
    %2.1 打开样图
    ImgName = '图像库\626.jpg';  %自己在这可换图像文件名(你要检索哪张图像，就换成它的名字)

    Q_img=imread(ImgName);
    figure,imshow(Q_img),title('待查找的样图')
    %若打开的是灰度图像，处理一下
    [H,W,dim]=size(Q_img);
    if (dim<3)
       t=Q_img;
       Q_img(:,:,1)=t;Q_img(:,:,2)=t;Q_img(:,:,3)=t;
    end
    %2.2 样图特征提取
    [Fea1]=HSV_Feature(Q_img);       %求图像的HSV颜色直方图特征
    
    disp('图像检索成功....');
    